#### Terraform Plan
```
random_password.db_password["app-postgresql"]: Refreshing state... [id=none]
scaleway_container_namespace.main: Refreshing state... [id=fr-par/847275c4-679b-4d08-9ed4-ec37f3e163cf]
scaleway_registry_namespace.main: Refreshing state... [id=fr-par/d93cff53-a5cc-4e37-97f1-343d79b33c10]
scaleway_rdb_instance.db["app-postgresql"]: Refreshing state... [id=fr-par/2115ef1e-0f64-4e41-a2ad-fda9136eeecf]
scaleway_rdb_database.db["app-postgresql"]: Refreshing state... [id=fr-par/2115ef1e-0f64-4e41-a2ad-fda9136eeecf/app]
scaleway_rdb_privilege.db["app-postgresql"]: Refreshing state... [id=fr-par/2115ef1e-0f64-4e41-a2ad-fda9136eeecf/app/app]
scaleway_container.service["app"]: Refreshing state... [id=fr-par/9b57bcb4-dd00-4876-9385-e91396482cfb]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # scaleway_container_namespace.main has been deleted
  - resource "scaleway_container_namespace" "main" {
      - id                       = "fr-par/847275c4-679b-4d08-9ed4-ec37f3e163cf" -> null
        name                     = "testjavathingy"
        # (8 unchanged attributes hidden)
    }

  # scaleway_registry_namespace.main has been deleted
  - resource "scaleway_registry_namespace" "main" {
      - endpoint        = "rg.fr-par.scw.cloud/testjavathingy" -> null
        id              = "fr-par/d93cff53-a5cc-4e37-97f1-343d79b33c10"
        name            = "testjavathingy"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # scaleway_container.service["app"] will be created
  + resource "scaleway_container" "service" {
      + cpu_limit                    = 1024
      + cron_status                  = (known after apply)
      + deploy                       = false
      + domain_name                  = (known after apply)
      + environment_variables        = (known after apply)
      + error_message                = (known after apply)
      + http_option                  = "redirected"
      + id                           = (known after apply)
      + local_storage_limit          = (known after apply)
      + max_concurrency              = (known after apply)
      + max_scale                    = 5
      + memory_limit                 = 1024
      + min_scale                    = 1
      + name                         = "testjavathingy-app"
      + namespace_id                 = (known after apply)
      + port                         = 8080
      + privacy                      = "public"
      + protocol                     = "http1"
      + registry_image               = (known after apply)
      + sandbox                      = (known after apply)
      + secret_environment_variables = (sensitive value)
      + status                       = (known after apply)
      + timeout                      = 300

      + health_check (known after apply)

      + scaling_option {
          + concurrent_requests_threshold = 50
        }
    }

  # scaleway_container_namespace.main will be created
  + resource "scaleway_container_namespace" "main" {
      + activate_vpc_integration = true
      + description              = "Serverless container namespace for testjavathingy"
      + destroy_registry         = false
      + id                       = (known after apply)
      + name                     = "testjavathingy"
      + organization_id          = (known after apply)
      + project_id               = (known after apply)
      + registry_endpoint        = (known after apply)
      + registry_namespace_id    = (known after apply)
    }

  # scaleway_rdb_database.db["app-postgresql"] will be created
  + resource "scaleway_rdb_database" "db" {
      + id          = (known after apply)
      + instance_id = (known after apply)
      + managed     = (known after apply)
      + name        = "app"
      + owner       = (known after apply)
      + size        = (known after apply)
    }

  # scaleway_rdb_instance.db["app-postgresql"] will be created
  + resource "scaleway_rdb_instance" "db" {
      + backup_same_region        = (known after apply)
      + backup_schedule_frequency = (known after apply)
      + backup_schedule_retention = (known after apply)
      + certificate               = (known after apply)
      + disable_backup            = false
      + endpoint_ip               = (known after apply)
      + endpoint_port             = (known after apply)
      + engine                    = "PostgreSQL-16"
      + id                        = (known after apply)
      + is_ha_cluster             = false
      + name                      = "testjavathingy-app-postgresql"
      + node_type                 = "DB-DEV-S"
      + organization_id           = (known after apply)
      + password                  = (sensitive value)
      + project_id                = (known after apply)
      + read_replicas             = (known after apply)
      + settings                  = (known after apply)
      + tags                      = [
          + "skepp",
          + "testjavathingy",
          + "app",
        ]
      + upgradable_versions       = (known after apply)
      + user_name                 = "app"
      + volume_size_in_gb         = (known after apply)
      + volume_type               = "lssd"

      + logs_policy (known after apply)

      + private_ip (known after apply)
    }

  # scaleway_rdb_privilege.db["app-postgresql"] will be created
  + resource "scaleway_rdb_privilege" "db" {
      + database_name = "app"
      + id            = (known after apply)
      + instance_id   = (known after apply)
      + permission    = "all"
      + user_name     = "app"
    }

  # scaleway_registry_namespace.main will be created
  + resource "scaleway_registry_namespace" "main" {
      + description     = "Container registry for testjavathingy"
      + endpoint        = (known after apply)
      + id              = (known after apply)
      + is_public       = false
      + name            = "testjavathingy"
      + organization_id = (known after apply)
      + project_id      = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ container_ids      = {
      ~ app = "fr-par/9b57bcb4-dd00-4876-9385-e91396482cfb" -> (known after apply)
    }
  ~ container_urls     = {
      ~ app = "testjavathingygbs8zbpf-testjavathingy-app.functions.fnc.fr-par.scw.cloud" -> (known after apply)
    }
  ~ database_endpoints = {
      ~ app-postgresql = {
          ~ host     = "51.158.110.27" -> (known after apply)
          ~ port     = 22521 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }
  ~ registry_endpoint  = "rg.fr-par.scw.cloud/testjavathingy" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
*Triggered by @skepp-dev[bot]*